## Pandas数据分析处理库-2

## 数据透视表

In [ ]:
#多变量之间的关系

## 程序有问题，没有执行出来

In [ ]:
import pandas as pd
df = pd.read_csv('D:/Temp/BI.LAB3/ansett.csv')
df

In [ ]:
df_pivot = df.pivot(index='Week',columns='Airports',values='Passengers')#统计一个指标并且按照什么方式去统计
df_pivot

In [ ]:
df_pivot.sum(axis = 1)#算行总和

In [ ]:
df_pivot.sum(axis = 0)#算列总和

## 可以执行出来

In [1]:
import pandas as pd
df = pd.read_csv('D:/Temp/BI.LAB3/ansett.csv')
df

          Week Airports     Class  Passengers
0     1989 W28  ADL-PER  Business         193
1     1989 W29  ADL-PER  Business         254
2     1989 W30  ADL-PER  Business         185
3     1989 W31  ADL-PER  Business         254
4     1989 W32  ADL-PER  Business         191
...        ...      ...       ...         ...
7402  1992 W43  SYD-PER     First         203
7403  1992 W44  SYD-PER     First         137
7404  1992 W45  SYD-PER     First         161
7405  1992 W46  SYD-PER     First         155
7406  1992 W47  SYD-PER     First         188

[7407 rows x 4 columns]

In [2]:
df.head()

       Week Airports     Class  Passengers
0  1989 W28  ADL-PER  Business         193
1  1989 W29  ADL-PER  Business         254
2  1989 W30  ADL-PER  Business         185
3  1989 W31  ADL-PER  Business         254
4  1989 W32  ADL-PER  Business         191

In [3]:
#默认值就是求平均
df.pivot_table(index = 'Class',columns = 'Airports',values = 'Passengers')#不同仓位在不同机场的乘客数

Airports,ADL-PER,MEL-ADL,MEL-BNE,MEL-OOL,MEL-PER,MEL-SYD,SYD-ADL,SYD-BNE,SYD-OOL,SYD-PER
Class,,,,,,,,,,
Business,262.681818,570.232955,374.681818,53.537143,443.039773,2213.136364,465.193182,1025.420455,172.539773,371.514286
Economy,2042.879859,7359.328622,5011.198582,2110.216312,4127.208481,21508.500000,4507.342756,14222.496454,3946.797872,2928.946996
First,144.035336,363.162544,224.521277,51.273050,263.657244,1461.560284,283.554770,759.053191,153.581560,237.333333

In [4]:
df.pivot_table(index = 'Class',columns = 'Airports',values = 'Passengers',aggfunc = 'max')#求最大值

Airports,ADL-PER,MEL-ADL,MEL-BNE,MEL-OOL,MEL-PER,MEL-SYD,SYD-ADL,SYD-BNE,SYD-OOL,SYD-PER
Class,,,,,,,,,,
Business,1015,2956,1719,251,1640,10433,1861,4319,655,1057
Economy,3305,12067,9532,5017,9464,32468,8356,22770,7573,7413
First,341,952,435,137,568,2716,828,1510,373,547

In [6]:
df.pivot_table(index = 'Class',columns = 'Airports',values = 'Passengers',aggfunc = 'count')

Airports,ADL-PER,MEL-ADL,MEL-BNE,MEL-OOL,MEL-PER,MEL-SYD,SYD-ADL,SYD-BNE,SYD-OOL,SYD-PER
Class,,,,,,,,,,
Business,176,176,176,175,176,176,176,176,176,175
Economy,283,283,282,282,283,282,283,282,282,283
First,283,283,282,282,283,282,283,282,282,282

In [9]:
df.crosstab(index = df['Class',columns = df['Airports']) #交叉表(crosstab)-'Airports'

SyntaxError: invalid syntax (Temp/ipykernel_13372/1490670898.py, line 1)

In [10]:
df['look'] = df['Passengers']<=500

In [11]:
df.pivot_table(index = 'look',columns = 'Airports',values = 'Passengers',aggfunc = 'mean')

Airports,ADL-PER,MEL-ADL,MEL-BNE,MEL-OOL,MEL-PER,MEL-SYD,SYD-ADL,SYD-BNE,SYD-OOL,SYD-PER
look,,,,,,,,,,
False,2095.366548,5606.827320,4645.829582,2219.757463,3715.753846,9761.045519,4072.87963,7027.209003,4043.605072,2784.793443
True,165.577007,311.799435,227.421911,50.985138,270.911271,136.594595,282.50000,291.076271,152.239224,256.259770

## 时间操作

In [13]:
import datetime

In [15]:
d = datetime.datetime(year=2022, month=3,day=29,hour=22,minute=44)#输出今天的时间
d

datetime.datetime(2022, 3, 29, 22, 44)

In [16]:
print(d)#转为标准格式

2022-03-29 22:44:00

In [17]:
import pandas as pd

In [19]:
ts = pd.Timestamp('2022-3-22')
ts

Timestamp('2022-03-22 00:00:00')

In [20]:
ts.month

3

In [21]:
ts.day

22

In [22]:
ts + pd.Timedelta('5 days')

Timestamp('2022-03-27 00:00:00')

In [23]:
# 11-12没有看结束

## 13.Pandas常用操作

In [25]:
import pandas as pd
data = pd.DataFrame({'group':['a','a','a','b','b','b','c','c','c'],
                    'data':[4,3,2,1,12,3,4,5,7]})
data

  group  data
0     a     4
1     a     3
2     a     2
3     b     1
4     b    12
5     b     3
6     c     4
7     c     5
8     c     7

In [29]:
#排序操作
data.sort_values(by=['group','data'],ascending = [False,True],inplace = True)#在前降序的情况下，后面保持升序

In [30]:
data

  group  data
6     c     4
7     c     5
8     c     7
3     b     1
5     b     3
4     b    12
2     a     2
1     a     3
0     a     4

In [31]:
data = pd.DataFrame({'k1':['one']*3+['two']*4,'k2':[3,2,1,3,3,4,4]})
data

    k1  k2
0  one   3
1  one   2
2  one   1
3  two   3
4  two   3
5  two   4
6  two   4

In [32]:
data.sort_values(by='k2')#默认升序

    k1  k2
2  one   1
1  one   2
0  one   3
3  two   3
4  two   3
5  two   4
6  two   4

In [34]:
data.drop_duplicates()#扔掉重复的值

    k1  k2
0  one   3
1  one   2
2  one   1
3  two   3
5  two   4

In [35]:
data.drop_duplicates(subset = 'k1')#以k1为基准去重复

    k1  k2
0  one   3
3  two   3

In [ ]:
pd.Date